In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame

In [2]:
dframe = DataFrame({'key1': ['x','x','y','y','z'],
                   'key2':['alpha','beta','alpha','beta','alpha'],
                   'dataset1':np.random.randn(5),
                   'dataset2':np.random.randn(5)})

In [9]:
dframe

   dataset1  dataset2 key1   key2
0 -0.682398 -0.146013    x  alpha
1 -0.091924  0.499794    x   beta
2 -0.311953  0.714679    y  alpha
3  0.816787  0.025485    y   beta
4 -0.389287  0.529192    z  alpha

In [10]:
group1 = dframe['dataset1'].groupby(dframe['key1'])

In [11]:
group1

In [12]:
group1.mean()

key1
x   -0.387161
y    0.252417
z   -0.389287
Name: dataset1, dtype: float64

In [7]:
group2 = dframe['dataset1'].groupby(dframe['key2'])

In [8]:
group2

In [11]:
group2.mean()

key2
alpha    0.530657
beta    -1.166157
Name: dataset1, dtype: float64

In [12]:
cities = np.array(['NY','LA', 'LA' , 'NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [13]:
dframe

   dataset1  dataset2 key1   key2
0  0.453105  0.150062    x  alpha
1 -2.341432 -0.098607    x   beta
2 -0.274451  0.799003    y  alpha
3  0.009117 -1.311845    y   beta
4  1.413317  0.818432    z  alpha

In [14]:
dframe['dataset1'].groupby([cities, month]).mean()

LA  FEB   -2.341432
    JAN   -0.274451
NY  FEB    0.009117
    JAN    0.933211
Name: dataset1, dtype: float64

In [15]:
dframe.groupby('key1').mean()

      dataset1  dataset2
key1
x    -0.944163  0.025727
y    -0.132667 -0.256421
z     1.413317  0.818432

In [17]:
dframe.groupby('key1').mean()

      dataset1  dataset2
key1
x    -0.944163  0.025727
y    -0.132667 -0.256421
z     1.413317  0.818432

In [18]:
dframe.groupby(['key1','key2']).mean()

            dataset1  dataset2
key1 key2
x    alpha  0.453105  0.150062
     beta  -2.341432 -0.098607
y    alpha -0.274451  0.799003
     beta   0.009117 -1.311845
z    alpha  1.413317  0.818432

In [13]:
dataset2_group = dframe.groupby(['key1','key2'])[['dataset2']]

In [14]:
dataset2_group

In [15]:
dataset2_group.mean()

            dataset2
key1 key2
x    alpha -0.146013
     beta   0.499794
y    alpha  0.714679
     beta   0.025485
z    alpha  0.529192

In [16]:
dframe.groupby(['key1']).size()

key1
x    2
y    2
z    1
dtype: int64

In [23]:
for name, group in dframe.groupby('key1'):
    print('This is the {} group'.format(name))
    print(group)
    print("\n")

This is the x group
   dataset1  dataset2 key1   key2
0 -0.682398 -0.146013    x  alpha
1 -0.091924  0.499794    x   beta


This is the y group
   dataset1  dataset2 key1   key2
2 -0.311953  0.714679    y  alpha
3  0.816787  0.025485    y   beta


This is the z group
   dataset1  dataset2 key1   key2
4 -0.389287  0.529192    z  alpha

In [26]:
for (k1,k2), group in dframe.groupby(['key1', 'key2']):
    print('key1={} key2={}'.format(k1,k2))
    print(group)
    print("\n")

key1=x key2=alpha
   dataset1  dataset2 key1   key2
0 -0.682398 -0.146013    x  alpha


key1=x key2=beta
   dataset1  dataset2 key1  key2
1 -0.091924  0.499794    x  beta


key1=y key2=alpha
   dataset1  dataset2 key1   key2
2 -0.311953  0.714679    y  alpha


key1=y key2=beta
   dataset1  dataset2 key1  key2
3  0.816787  0.025485    y  beta


key1=z key2=alpha
   dataset1  dataset2 key1   key2
4 -0.389287  0.529192    z  alpha

In [28]:
gr = dframe.groupby('key1')

In [29]:
gr.get_group('x')

   dataset1  dataset2 key1   key2
0 -0.682398 -0.146013    x  alpha
1 -0.091924  0.499794    x   beta

In [30]:
group_dict = dict(list(dframe.groupby('key1')))

In [33]:
group_dict['x']

   dataset1  dataset2 key1   key2
0 -0.682398 -0.146013    x  alpha
1 -0.091924  0.499794    x   beta

In [36]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes, axis = 1)))

In [37]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -0.682398 -0.146013
 1 -0.091924  0.499794
 2 -0.311953  0.714679
 3  0.816787  0.025485
 4 -0.389287  0.529192, dtype('O'):   key1   key2
 0    x  alpha
 1    x   beta
 2    y  alpha
 3    y   beta
 4    z  alpha}